# 3. [Pandas](https://www.freecodecamp.org/news/how-to-analyze-data-with-python-pandas/)
Pandas is a Python library used for working with data sets. This is the "must-learn" library for Data I/O, cleansing, transforming and aggregation. It is an external library so we need to import it in your applications by adding the `import` keyword

In [1]:
import pandas as pd

Now the `Pandas` package can be referred to as `pd` instead of pandas.

## 3.1 [Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)

The first pandas data strucuture is a Series. A Series is a one-dimensional array that can hold any datatype, similar to a ndarray. However, a Series has a **index** that gives a a label to each entry. An index generally is used to label the data.
Typically a Series contains information about **one feature** of the data. <br>

A `Pandas Series` is a one-dimensional array of indexed data. It can be created from a list or array as follows:

#### From `lists` to `Series`

In [3]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
print( data )

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

#### From `NumPy array` to `Series`

In [19]:
array = np.array( [ 10, 20, 1, 2, 
                    3, 4, 5, 6, 7 ] )
series1 = pd.Series( array )
series1

0    10
1    20
2     1
3     2
4     3
5     4
6     5
7     6
8     7
dtype: int32

#### From `Dictionary` to `Series`

In [18]:
population_dict = { 'California' : 38332521,
                    'Texas'      : 26448193,
                    'New York'   : 19651127,
                    'Florida'    : 19552860,
                    'Illinois'   : 12882135 }
population = pd.Series( population_dict )
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

As we see in the output, the `Series` wraps both a sequence of values and a sequence of indices, which we can access with the `values` and `index` attributes. The values are simply a familiar NumPy array:

In [20]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [21]:
data.index

RangeIndex(start=0, stop=4, step=1)

#### `Series` vs `NumPy`
The essential difference is the presence of the index: while the `Numpy Array` has an implicitly defined integer index used to access the values, the `Pandas Series` has an explicitly defined index associated with the values. <br>

The `index` do not need to be an integer. we can use `strings`.

In [10]:
import numpy as np
math = pd.Series(np.arange(5.,21.,3.),['joyce','jeremy','ivan','marcy','daniel','franclin'])
math

joyce        5.0
jeremy       8.0
ivan        11.0
marcy       14.0
daniel      17.0
franclin    20.0
dtype: float64

Excersice: <br>
Get the `values` and `index` from `math` `Series`.

### 3.1.1. Indexing

Indexing in pandas means simply selecting particular rows and columns of data from a DataFrame. Indexing could mean selecting all the rows and some of the columns, some of the rows and all of the columns, or some of each of the rows and columns. Indexing can also be known as Subset Selection.

In [25]:
print( data )
print( population )

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [26]:
print( data[ 1:3 ] )

1    0.50
2    0.75
dtype: float64

In [27]:
print( population[ 'California':'Illinois' ] )

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

| Method 	| Definition 	|
| --- 	| --- 	|
| loc() 	| Gets rows (and/or columns) with particular labels.<br> Accept `Boolean` for indexing. |
| iloc() 	| gets rows (and/or columns) at integer locations. <br> Do not accept `Boolean` for indexing.|

Get the value of New York.

In [32]:
population.loc[ "New York" ]

19651127

In [33]:
population.iloc[ 2 ]

19651127

In [34]:
print( population.loc[ "New York" ] == population.iloc[ 2 ] )

True

Replicate this excersice for `data` Series.

## 3.2 [DataFrame](https://www.w3schools.com/python/pandas/pandas_dataframes.asp)

A DataFrame is a collection of multiple Series. It can be thought of as a 2-dimensional array, where each row is a separate datapoint and each column is a feature of the data. The rows are labeled with an index(as in a Series) and the columns are lebeled in the attribute columns.<br>
There are many different ways to initialize a DataFrame. <br>

#### From `lists` and `dict` to `DataFrame`

In [78]:
# Grades
students = [ "Alejandro", "Pedro", "Ramiro", "Axel", "Juan" ]
math     = [ 15, 16, 10, 12, 13 ]
english  = [ 13, 9, 16, 14, 17 ]
art      = [ 12, 16, 15, 19, 10 ]

# Dictionary
grades_A = {'Students':students, 'Math':math, 'English':english, 'Art':art}

In [79]:
gradesA1 = pd.DataFrame( grades_A )
gradesA1

    Students  Math  English  Art
0  Alejandro    15       13   12
1      Pedro    16        9   16
2     Ramiro    10       16   15
3       Axel    12       14   19
4       Juan    13       17   10

#### From `lists` and `NumPy` to `DataFrame`

In [48]:
values = np.array([ [ 1, 2, 3 ], [ 4, 5, 6 ], [ 7, 8, 9 ] ] )
col_names = [ 'a', 'b', 'c' ]
data2 = pd.DataFrame( values ,
                   columns= col_names )
data2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### 3.2.1 Indexing

We can use the same methods as `Series`: `iloc` and `loc`. We can select columns and rows.

In [50]:
gradesA1

    Students  Math  English  Art
0  Alejandro    15       13   12
1      Pedro    16        9   16
2     Ramiro    10       16   15
3       Axel    12       14   19
4       Juan    13       17   10

In [56]:
gradesA1.loc[ 0:3, ["Students" , "Math"] ]

    Students  Math
0  Alejandro    15
1      Pedro    16
2     Ramiro    10
3       Axel    12

In [52]:
gradesA1.iloc[ 0:3, 1:3 ]

   Math  English
0    15       13
1    16        9
2    10       16

|Method|Description|
|------|-----------|
|columns()|Get the name of the columns.|
|sort_values()|Sort by the values along either axis.|
|sort_index()|Sort by the index.|
|head()|Show the first N observations.|
|drop( )| Remove the entries  <br>  with the specified label or labels|
|append( )| Concatenate two or more Series.|
|drop_duplicates( )| Remove duplicate values|
|dropna( ) |Drop null entries|
|fillna( ) |Replace null entries <br> with a specified value or strategy|
|reset_index( )| Index as column.|
|sample( ) |Draw a random entry|
|shift( ) |Shift the index|
|unique( ) |Return unique values|

In [59]:
deps = {
        'dep' : ['Lima', 'Piura', 'Tumbes', 'Cuzco', 'Ica', 'Puno'],
        'year': [ 2000, 2001, 2002, 2001, 2002, 2003 ],
        'pop' : [ 1.5, 1.7, 3.6, 2.4, 2.9, 3.2 ] 
        }
dep1 = pd.DataFrame( deps )
dep1

      dep  year  pop
0    Lima  2000  1.5
1   Piura  2001  1.7
2  Tumbes  2002  3.6
3   Cuzco  2001  2.4
4     Ica  2002  2.9
5    Puno  2003  3.2

In [60]:
# Not `inplace` argument
dep1.sort_values(['year','pop'],ascending = False)

      dep  year  pop
5    Puno  2003  3.2
2  Tumbes  2002  3.6
4     Ica  2002  2.9
3   Cuzco  2001  2.4
1   Piura  2001  1.7
0    Lima  2000  1.5

In [61]:
dep1

      dep  year  pop
0    Lima  2000  1.5
1   Piura  2001  1.7
2  Tumbes  2002  3.6
3   Cuzco  2001  2.4
4     Ica  2002  2.9
5    Puno  2003  3.2

In [62]:
# Not `inplace` argument
dep1.sort_values(['year','pop'],ascending = False , inplace = True )
dep1

      dep  year  pop
5    Puno  2003  3.2
2  Tumbes  2002  3.6
4     Ica  2002  2.9
3   Cuzco  2001  2.4
1   Piura  2001  1.7
0    Lima  2000  1.5

In [65]:
# Back to the original
dep1.sort_index( inplace = True )
dep1

      dep  year  pop
0    Lima  2000  1.5
1   Piura  2001  1.7
2  Tumbes  2002  3.6
3   Cuzco  2001  2.4
4     Ica  2002  2.9
5    Puno  2003  3.2

In [80]:
# Operations with DataFrame, new column
gradesA1[ 'avg' ] = ( gradesA1[ 'Math' ] + gradesA1[ 'Math' ] + gradesA1[ 'Art' ] ) / 3
gradesA1

    Students  Math  English  Art        avg
0  Alejandro    15       13   12  14.000000
1      Pedro    16        9   16  16.000000
2     Ramiro    10       16   15  11.666667
3       Axel    12       14   19  14.333333
4       Juan    13       17   10  12.000000

In [81]:
# head
gradesA1.head( 2 )

    Students  Math  English  Art   avg
0  Alejandro    15       13   12  14.0
1      Pedro    16        9   16  16.0

In [82]:
# drop column
# Always use copy when you want to modify your DataFrame
gradesA1_1 = gradesA1.drop( [ 'avg' , 'Art' ], axis = 1 ).copy()
gradesA1_1

    Students  Math  English
0  Alejandro    15       13
1      Pedro    16        9
2     Ramiro    10       16
3       Axel    12       14
4       Juan    13       17

In [89]:
# add new data gradesA2
students = [ "Rebeca", "Xavi", "Cristiano", "Ronaldo", "Leo" ]
math     = [ 15, 18, 14, 7, 10 ]
english  = [ 18, 9, 11, 12, 20 ]
art      = [ 10, 16, 20, 19, 5 ]

# Dictionary
grades_A2 = {'Students':students, 'Math':math, 'English':english, 'Art':art}
gradesA2 = pd.DataFrame( grades_A2 )
print( gradesA2 , "\n")

grades_total  = gradesA1_1.append( gradesA2 ).copy()
print( grades_total )

    Students  Math  English  Art
0     Rebeca    15       18   10
1       Xavi    18        9   16
2  Cristiano    14       11   20
3    Ronaldo     7       12   19
4        Leo    10       20    5

    Students  Math  English   Art
0  Alejandro    15       13   NaN
1      Pedro    16        9   NaN
2     Ramiro    10       16   NaN
3       Axel    12       14   NaN
4       Juan    13       17   NaN
0     Rebeca    15       18  10.0
1       Xavi    18        9  16.0
2  Cristiano    14       11  20.0
3    Ronaldo     7       12  19.0
4        Leo    10       20   5.0

In [90]:
cars = pd.DataFrame({
            'brands'    : [ 'hyundai', 'hyundai', 'kia', 'kia', 'kia' ] ,
            'model'     : [ 'sedan', 'sedan', 'sedan', 'truck', 'truck' ] ,
            'passengers': [ 4, 4, 5, 6, 8 ]
            })
cars

    brands  model  passengers
0  hyundai  sedan           4
1  hyundai  sedan           4
2      kia  sedan           5
3      kia  truck           6
4      kia  truck           8

In [93]:
cars_subset = cars.drop_duplicates(subset = [ 'brands' ]).copy()
cars_subset

    brands  model  passengers
0  hyundai  sedan           4
2      kia  sedan           5

In [94]:
cars.drop_duplicates(subset = ['brands','model'], keep = 'last')

    brands  model  passengers
1  hyundai  sedan           4
2      kia  sedan           5
4      kia  truck           8

In [98]:
# dropna
print( grades_total , "\n" )
grades_total_NA = grades_total.dropna().copy()
print( grades_total_NA )

    Students  Math  English   Art
0  Alejandro    15       13   NaN
1      Pedro    16        9   NaN
2     Ramiro    10       16   NaN
3       Axel    12       14   NaN
4       Juan    13       17   NaN
0     Rebeca    15       18  10.0
1       Xavi    18        9  16.0
2  Cristiano    14       11  20.0
3    Ronaldo     7       12  19.0
4        Leo    10       20   5.0

    Students  Math  English   Art
0     Rebeca    15       18  10.0
1       Xavi    18        9  16.0
2  Cristiano    14       11  20.0
3    Ronaldo     7       12  19.0
4        Leo    10       20   5.0

In [102]:
# fillna
print( grades_total , "\n" )
grades_total_fill_na = grades_total.fillna( "Na value" ).copy()
print( grades_total_fill_na )

    Students  Math  English   Art
0  Alejandro    15       13   NaN
1      Pedro    16        9   NaN
2     Ramiro    10       16   NaN
3       Axel    12       14   NaN
4       Juan    13       17   NaN
0     Rebeca    15       18  10.0
1       Xavi    18        9  16.0
2  Cristiano    14       11  20.0
3    Ronaldo     7       12  19.0
4        Leo    10       20   5.0

    Students  Math  English       Art
0  Alejandro    15       13  Na value
1      Pedro    16        9  Na value
2     Ramiro    10       16  Na value
3       Axel    12       14  Na value
4       Juan    13       17  Na value
0     Rebeca    15       18        10
1       Xavi    18        9        16
2  Cristiano    14       11        20
3    Ronaldo     7       12        19
4        Leo    10       20         5

In [113]:
# reset_index()
print( grades_total , "\n" )
print( grades_total.reset_index() , "\n" )
print( grades_total.reset_index( drop = True ) )

    Students  Math  English   Art
0  Alejandro    15       13   NaN
1      Pedro    16        9   NaN
2     Ramiro    10       16   NaN
3       Axel    12       14   NaN
4       Juan    13       17   NaN
0     Rebeca    15       18  10.0
1       Xavi    18        9  16.0
2  Cristiano    14       11  20.0
3    Ronaldo     7       12  19.0
4        Leo    10       20   5.0

   index   Students  Math  English   Art
0      0  Alejandro    15       13   NaN
1      1      Pedro    16        9   NaN
2      2     Ramiro    10       16   NaN
3      3       Axel    12       14   NaN
4      4       Juan    13       17   NaN
5      0     Rebeca    15       18  10.0
6      1       Xavi    18        9  16.0
7      2  Cristiano    14       11  20.0
8      3    Ronaldo     7       12  19.0
9      4        Leo    10       20   5.0

    Students  Math  English   Art
0  Alejandro    15       13   NaN
1      Pedro    16        9   NaN
2     Ramiro    10       16   NaN
3       Axel    12       14   NaN
4       Juan    13       17   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

|afdad|asd|
|---|---|
|sample( ) |Draw a random entry|
|shift( ) |Shift the index|
|unique( ) |Return unique values|

In [121]:
# sample( )
print( grades_total.sample( n = 5) , "\n" )
print( grades_total.sample( frac = 0.5) , "\n" )

    Students  Math  English   Art
2  Cristiano    14       11  20.0
3    Ronaldo     7       12  19.0
0  Alejandro    15       13   NaN
4       Juan    13       17   NaN
3       Axel    12       14   NaN

    Students  Math  English   Art
1       Xavi    18        9  16.0
4       Juan    13       17   NaN
0  Alejandro    15       13   NaN
1      Pedro    16        9   NaN
2     Ramiro    10       16   NaN

In [130]:
# reset_index
print( grades_total, "\n" )
print( grades_total.reset_index( drop = True ).shift( 1  ), "\n" )

    Students  Math  English   Art
0  Alejandro    15       13   NaN
1      Pedro    16        9   NaN
2     Ramiro    10       16   NaN
3       Axel    12       14   NaN
4       Juan    13       17   NaN
0     Rebeca    15       18  10.0
1       Xavi    18        9  16.0
2  Cristiano    14       11  20.0
3    Ronaldo     7       12  19.0
4        Leo    10       20   5.0

    Students  Math  English   Art
0        NaN   NaN      NaN   NaN
1  Alejandro  15.0     13.0   NaN
2      Pedro  16.0      9.0   NaN
3     Ramiro  10.0     16.0   NaN
4       Axel  12.0     14.0   NaN
5       Juan  13.0     17.0   NaN
6     Rebeca  15.0     18.0  10.0
7       Xavi  18.0      9.0  16.0
8  Cristiano  14.0     11.0  20.0
9    Ronaldo   7.0     12.0  19.0

In [129]:
# unique
cars['brands'].unique()

array(['hyundai', 'kia'], dtype=object)

### 3.2.2 Importing Data

|Method|Description|
|------|-----------|
|read_excel( )|Read a excel and convert to a excel file|
|to_csv( )| Write the index and entries to a CSV file|
|read_csv( )| Read a csv and convert into a DataFrame|
|to_json( )| Convert the object to a JSON string|
|to_pickle( )| Serialize the object and store it in an external file|
|to_sql( )| Write the object data to an open SQL database|
|read_html( )| Read a table in an html page and convert to a DataFrame|

[EMIF data source](https://www.colef.mx/emif/basescuestionarios.html)

In [152]:
# read data
emif1993 = pd.read_csv( r"../_data\emif_1993.csv" )
# labels of variables
labels_emif1993 = pd.read_csv( r"../_data\PDS_Descriptores_1993.csv" )
# adding labels to variables
emif1993.attrs[ 'labels' ] = labels_emif1993

In [170]:
# susan data
df1 = pd.read_csv("https://docs.google.com/uc?id=1kSxrVci_EUcSr_Lg1JKk1l7Xd5I9zfRC&export=download")
df1.shape

(28653, 9)

### 3.2.3 Dealing with nulls

We drop columns that at least 30% values are null to simplify our Exploratory Data Analysis (EDA).

In [251]:
null_sum = df1.isnull().sum()
df1.columns[ null_sum < len( df1 ) * 0.3 ]

Index(['X', 'y', 'w', 'age', 'polviews', 'income', 'educ', 'marital', 'sex'], dtype='object')

In [253]:
df1.drop(columns=df1.columns[null_sum > len(df1) * 0.3], inplace=True)

### 3.2.4 Filtering data

In [167]:
# select observations
# when we create a sample from our data, copy the object.
df1_45_5 = df1.loc[ ( df1.age > 45 ) & ( df1_45.polviews < 5 ), : ].copy()

In [169]:
df1_45_5.shape

(7852, 9)

In [174]:
# Select columns with regex
# All the columns that start with N10
emif1993.filter( regex = "N10*").head()

   N10_212  N10_213
0       10        2
1       10        4
2        0        0
3        0        0
4        0        0

In [178]:
# all columns that have an X
emif1993.filter( like = "X").head()

   SEXO  X8_5  X8_14  X10_212  X20_3_7
0     1     6      0        6        0
1     2     4      0        6        0
2     2     1      0        0        0
3     1     6      0        0        0
4     1     6      0        0        0

In [204]:
# cheack ID in pandas
emif1993['NUM_PER'].is_unique
emif1993['FOLIO'].is_unique

False

In [211]:
(emif1993['FOLIO'].astype(str) + "_" + emif1993['UNIDAD'].astype(str) + "_" + emif1993['NUM_PER'].astype(str)).is_unique

False

In [217]:
# Get name of columns
emif1993.columns

Index(['FOLIO', 'UNIDAD', 'TRIM', 'REG_MUE', 'SEXO', 'EDAD', 'LOCALI',
       'MUN_NAC', 'PAI_NAC', 'VIE_UD',
       ...
       'N8_15', 'N10_212', 'N10_213', 'N20_3_7', 'N20_3_8', 'X8_5', 'X8_14',
       'X10_212', 'X20_3_7', 'PONDERAD'],
      dtype='object', length=175)

### 3.2.5 Groupby

In [277]:
emif1993.reset_index().groupby( [ 'LOCALI', 'SEXO' ] )['EDAD'].mean()

LOCALI  SEXO
0       1       29.736591
        2       32.455357
1       1       29.535550
        2       29.950226
2       1       27.514558
        2       25.927966
5       1       18.000000
7       1       33.600000
8       1       26.000000
        2       30.000000
9       1       25.000000
        2       25.500000
Name: EDAD, dtype: float64

In [278]:
emif1993.reset_index().groupby( [ 'LOCALI', 'SEXO' ] )[['EDAD']].mean()

                  EDAD
LOCALI SEXO
0      1     29.736591
       2     32.455357
1      1     29.535550
       2     29.950226
2      1     27.514558
       2     25.927966
5      1     18.000000
7      1     33.600000
8      1     26.000000
       2     30.000000
9      1     25.000000
       2     25.500000

In [279]:
emif1993.reset_index().groupby( [ 'LOCALI', 'SEXO' ] , as_index = False )[['EDAD']].mean()

    LOCALI  SEXO       EDAD
0        0     1  29.736591
1        0     2  32.455357
2        1     1  29.535550
3        1     2  29.950226
4        2     1  27.514558
5        2     2  25.927966
6        5     1  18.000000
7        7     1  33.600000
8        8     1  26.000000
9        8     2  30.000000
10       9     1  25.000000
11       9     2  25.500000

#### [Agg](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.agg.html)
Aggregate using one or more operations over the specified axis.

In [284]:
emif1993.reset_index().groupby( [ 'LOCALI', 'SEXO' ] , as_index = False ).agg( { "EDAD": "mean" } )

    LOCALI  SEXO       EDAD
0        0     1  29.736591
1        0     2  32.455357
2        1     1  29.535550
3        1     2  29.950226
4        2     1  27.514558
5        2     2  25.927966
6        5     1  18.000000
7        7     1  33.600000
8        8     1  26.000000
9        8     2  30.000000
10       9     1  25.000000
11       9     2  25.500000

In [286]:
emif1993_age = emif1993.reset_index().groupby( 
                                [ 'LOCALI', 'SEXO' ] , 
                                as_index = False 
                               ).agg( 
                                    edad_max = ( 'EDAD', max ),
                                    edad_min = ( 'EDAD', min ), 
                                    edad_mean = ( 'EDAD', np.mean ) 
                                )

emif1993_age

    LOCALI  SEXO  edad_max  edad_min  edad_mean
0        0     1        86        12  29.736591
1        0     2        86        15  32.455357
2        1     1        81        14  29.535550
3        1     2        78        13  29.950226
4        2     1        77        14  27.514558
5        2     2        72        12  25.927966
6        5     1        18        18  18.000000
7        7     1        47        21  33.600000
8        8     1        53        17  26.000000
9        8     2        44        16  30.000000
10       9     1        25        25  25.000000
11       9     2        30        21  25.500000

### 3.2.6 Reshape

##### 3.2.6.1 From Wide to Long

In [321]:
emif1993_age.head()

   LOCALI  SEXO  edad_max  edad_min  edad_mean
0       0     1        86        12  29.736591
1       0     2        86        15  32.455357
2       1     1        81        14  29.535550
3       1     2        78        13  29.950226
4       2     1        77        14  27.514558

In [324]:
emif1993_age_stack = emif1993_age.set_index(  ['LOCALI', 'SEXO' ]  ).stack().reset_index().rename( {"level_2" : "STATS", 
                                                                                0 : "VALUES" }, axis = 1 )
emif1993_age_stack.head()

   LOCALI  SEXO      STATS     VALUES
0       0     1   edad_max  86.000000
1       0     1   edad_min  12.000000
2       0     1  edad_mean  29.736591
3       0     2   edad_max  86.000000
4       0     2   edad_min  15.000000

In [325]:
emif1993_age_melt = emif1993_age.melt( 
                    id_vars = ['LOCALI', 'SEXO' ] ,
                    var_name = 'STATS', 
                    value_name = 'VALUES'
                 )
emif1993_age_melt.head()

   LOCALI  SEXO     STATS  VALUES
0       0     1  edad_max    86.0
1       0     2  edad_max    86.0
2       1     1  edad_max    81.0
3       1     2  edad_max    78.0
4       2     1  edad_max    77.0

##### 3.2.6.1 From Long to Wide

In [409]:
emif1993_age_stack.set_index(  ['LOCALI', 'SEXO', "STATS" ]  ).unstack().head()

              VALUES
STATS       edad_max  edad_mean edad_min
LOCALI SEXO
0      1        86.0  29.736591     12.0
       2        86.0  32.455357     15.0
1      1        81.0  29.535550     14.0
       2        78.0  29.950226     13.0
2      1        77.0  27.514558     14.0

In [408]:
df3 = emif1993_age_stack.set_index(  ['LOCALI', 'SEXO', "STATS" ]  ).unstack().rename_axis( [None, None], axis = 1 )
df3.head()

              VALUES
            edad_max  edad_mean edad_min
LOCALI SEXO
0      1        86.0  29.736591     12.0
       2        86.0  32.455357     15.0
1      1        81.0  29.535550     14.0
       2        78.0  29.950226     13.0
2      1        77.0  27.514558     14.0

In [410]:
df3.columns = emif1993_age_stack.STATS.unique()

df3.reset_index().head()

   LOCALI  SEXO  edad_max   edad_min  edad_mean
0       0     1      86.0  29.736591       12.0
1       0     2      86.0  32.455357       15.0
2       1     1      81.0  29.535550       14.0
3       1     2      78.0  29.950226       13.0
4       2     1      77.0  27.514558       14.0

In [411]:
df_l_w = emif1993_age_stack.pivot( index = ['LOCALI', 'SEXO' ], 
                         columns = 'STATS' ,
                         values = 'VALUES' 
                        ).rename_axis( [None], axis = 1 ).reset_index()
df_l_w.head()

   LOCALI  SEXO  edad_max  edad_mean  edad_min
0       0     1      86.0  29.736591      12.0
1       0     2      86.0  32.455357      15.0
2       1     1      81.0  29.535550      14.0
3       1     2      78.0  29.950226      13.0
4       2     1      77.0  27.514558      14.0

### 3.2.7 [Merge](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html)

In [414]:
emif1993.merge( df_l_w , on = ['LOCALI', 'SEXO'] , how = "left" , validate = "m:1" ).head()

,FOLIO,UNIDAD,TRIM,REG_MUE,SEXO,EDAD,LOCALI,MUN_NAC,PAI_NAC,VIE_UD,...,N20_3_7,N20_3_8,X8_5,X8_14,X10_212,X20_3_7,PONDERAD,edad_max,edad_mean,edad_min
0,3005,159306,1,4,1,24,1,17,10,10,...,0,0,6,0,6,0,577.20,81.0,29.535550,14.0
1,3004,159306,1,4,2,20,2,35,5,5,...,0,0,4,0,6,0,144.30,72.0,25.927966,12.0
2,2996,159305,1,4,2,22,1,35,5,5,...,0,0,1,0,0,0,176.77,78.0,29.950226,13.0
3,3009,159306,1,4,1,25,1,45,8,8,...,0,0,6,0,0,0,86.58,81.0,29.535550,14.0
4,3010,159306,1,4,1,36,2,5,10,10,...,0,0,6,0,0,0,89.47,77.0,27.514558,14.0

In [ ]:
emif1993.merge( )

### References

1. https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.agg.html
2. https://towardsdatascience.com/all-the-core-functions-of-python-pandas-you-need-to-know-d219cbd87636
3. https://pandas.pydata.org/docs/reference/api/pandas.melt.html#pandas.melt
4. https://stackoverflow.com/questions/47152691/how-can-i-pivot-a-dataframe
5. https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot.html
6. https://stackoverflow.com/questions/11346283/renaming-column-names-in-pandas